{"title":"NDAP Amendments to its BY-LAWS ","description":"","fields":[{"title":"Dear NDAP Member,","type":"element-section-break","required":false,"position":1,"description":"Our organization is in the process of applying for a new SEC registration and preparing for the application as AIPO to be submitted to PRC. Both applications require ratification of amendments to the NDAP by laws and constitution. At the Board Meeting held last February 24 at Marriott Hotel, changes in the NDAP by-laws to make it responsive to RA 10862 (ND Law of 2016) and the CPD Law were approved.\n\nWe are requesting you to look at the changes and ratify them by putting “Agree” on the textfield. If not, please state your reason why you don’t approve of the change.\n"},{"title":"1.ARTICLE VI - MEETING OF MEMBERS: Section 1","type":"element-section-break","required":false,"position":2,"description":"The Association shall hold a general meeting once a year, during the fourth Thursday of February at its principal office, or at any place within the Philippines which the Board may designate; Provided, That proper notice is sent to all  members indicating the date, time and place of the meeting. The date of the Association’s general meeting must be indicated to comply with the Corporation Law of the Philippines."},{"title":"1. Answer","type":"element-single-line-text","required":true,"position":3},{"title":"2.ARTICLE VII - BOARD OF DIRECTORS AND OFFICERS OF THE ASSOCIATION: ","type":"element-section-break","required":false,"position":4,"description":"Section 1\tInclusion of an Ethics Committee in the Standing Committees"},{"title":"2. Answer","type":"element-single-line-text","required":true,"position":5},{"title":"3.ARTICLE VII - BOARD OF DIRECTORS AND OFFICERS OF THE ASSOCIATION:","type":"element-section-break","required":false,"position":6,"description":" Section 14: The Sections that represent the specific fields or areas of practice in Nutrition and Dietetics were defined as follows:<br><br>a.\tHospital Dietetics Section covers clinical dietitians, therapeutic dietitians, administrative dietitians, food service managers and/or nutrition support unit heads in hospital settings.<br><br>\nb.\tCommunity and Public Health Nutrition Section covers nutrition-dietetics professionals involved in food and nutrition policy formulation, community assessment, planning, implementation, monitoring, evaluation of nutrition programs and advocacy; including consultants and technical advisers on nutrition.<br><br>c.\tFood service Section covers nutrition-dietetics consultants and managers in food service establishments engaged in institutional food production, recipe development and standardization, implementation of food safety and sanitation practices, delivery and evaluation of services.<br><br>d.\tEducation and Research Section covers the Academe (teachers/instructors of nutrition, dietetics and food service courses) and Food and Nutrition Research which include professionals in basic and applied food and nutrition research.<br><br>e.\tBusiness and Industry Section covers professionals working in the business and industry doing work requiring nutrition and dietetics background that includes private practitioners and consultants in nutrition; professionals involved in developing and producing new food products following the principles of food and nutrition; and professionals and consultants involved in nutrition aspects in wellness and sports program."},{"title":"3. Answer","type":"element-single-line-text","required":true,"position":7},{"title":"4.ARTICLE IX - NOMINATIONS AND ELECTIONS: We ","type":"element-section-break","required":false,"position":8,"description":" We reverted back to the 15 candidates who obtained the highest number of votes instead of sectoral winners.\nSection 14: Thirty (30) active members from the five different sectors (hospital-dietetics, public health, foodservice, research & education, and business & industry as candidates for the Board of Directors. The first fifteen (15) who get the highest number of votes shall be considered elected. In case of tie on the 15th place, the choice shall be decided by lot\n"},{"title":"4. Answer","type":"element-single-line-text","required":true,"position":9},{"title":"Thank you!","type":"element-section-break","required":false,"position":10,"description":"Legislation Committee<br>Chair: Prof. Dr. Adela Jamorabo-Ruiz, RND<br>Members:  Dr. Zenaida V. Narciso, RND<br>Ms. Josephine P. Jamon, RND, MM, MBA\n"},{"title":"Please rate your experience in using iVote++","type":"element-multiple-choice","required":true,"position":11,"choices":[{"title":"Excellent","value":"Excellent","checked":true},{"title":"Very good","value":"Very good","checked":false},{"title":"Good","value":"Good","checked":false},{"title":"Fair","value":"Fair","checked":false},{"title":"Unsatisfactory","value":"Unsatisfactory","checked":false}]}]}